eisup_2019_docmng_integration/src/Catalogs/абс_Подписанты/абс_Подписанты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_Подписанты</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПодписанта</name>
    <type>
      <types>EnumRef.абс_ВидыПодписантов</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доверенность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/InformationRegisters/ОтветственныеЛицаОрганизаций/ОтветственныеЛицаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеЛицаОрганизаций</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ФизическоеЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтветственноеЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/ОтветственныеЛицаОрганизаций/ОтветственныеЛицаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОтветственныеЛицаОрганизаций</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Руководитель</name>
  </enumValues>
  <enumValues>
    <name>ГлавныйБухгалтер</name>
  </enumValues>
  <enumValues>
    <name>РуководительКадровойСлужбы</name>
  </enumValues>
  <enumValues>
    <name>Кассир</name>
  </enumValues>
  <enumValues>
    <name>ОтветственныйЗаНалоговыеРегистры</name>
  </enumValues>
  <enumValues>
    <name>УполномоченныйПредставитель</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
  </enumValues>
  <enumValues>
    <name>Исполнитель</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/абс_Подписанты/ObjectModule.bsl
Функция ОтветственныеЛицаОрганизаций(Организация, ДатаСреза)
	
	Результат = Новый Структура("Руководитель, РуководительДолжность, ГлавныйБухгалтер");//, Кассир, Исполнитель, ИсполнительДолжность, ОтветственныйЗаРегистры");
	
	ЗапросПоЛицам = Новый Запрос();
	ЗапросПоЛицам.УстановитьПараметр("Организация", Организация);
	ЗапросПоЛицам.УстановитьПараметр("ДатаСреза",   ДатаСреза);
	
	ЗапросПоЛицам.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо,
	                      |	ОтветственныеЛицаОрганизацийСрезПоследних.Должность.Наименование КАК Должность,
	                      |	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо
	                      |ИЗ
	                      |	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаСреза, СтруктурнаяЕдиница = &Организация) КАК ОтветственныеЛицаОрганизацийСрезПоследних";
	
	Выборка = ЗапросПоЛицам.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда
			Результат.Руководитель            = Выборка.ФизическоеЛицо;
			Результат.РуководительДолжность   = Выборка.Должность;
			
		ИначеЕсли Выборка.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда
			Результат.ГлавныйБухгалтер        = Выборка.ФизическоеЛицо;			
		КонецЕсли;

	КонецЦикла; 
	
	Возврат Результат;
		
КонецФункции

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	//АБС ВСТАВКА №000020910 НАЧАЛО
	//Руководители = ОтветственныеЛицаОрганизаций(Организация, абс_СерверныеФункции.ПолучитьДатуСервера());
	//Руководитель = Руководители.Руководитель;
	//Бухгалтер    = Руководители.ГлавныйБухгалтер;	
	//Если Сотрудник.Физлицо <> Руководитель Или Сотрудник.Физлицо <> Бухгалтер
	//	//И Не ЗначениеЗаполнено(Доверенность)   //Задача 000019635 
	//	Тогда                                		
	//	ttk_ОбщегоНазначения.СообщитьОбОшибке("Сотрудник не является ни руководителем, ни главным бухгалтером.", Отказ);		
	//КонецЕсли;
	//\\АБС ВСТАВКА №000020910 КОНЕЦ
	
	Если ЗначениеЗаполнено(ПоУмолчанию) И ПоУмолчанию <> "-" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	абс_Подписанты.Ссылка
		               |ИЗ
		               |	Справочник.абс_Подписанты КАК абс_Подписанты
		               |ГДЕ
		               |	абс_Подписанты.Организация = &Организация
		               |	И абс_Подписанты.ВидПодписанта = &ВидПодписанта
		               |	И абс_Подписанты.НеИспользовать = ЛОЖЬ
		               |	И абс_Подписанты.ПоУмолчанию = &ПоУмолчанию
		               |	И абс_Подписанты.Ссылка <> &Ссылка";
					   
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ВидПодписанта", ВидПодписанта);
		Запрос.УстановитьПараметр("ПоУмолчанию",   ПоУмолчанию);
		Запрос.УстановитьПараметр("Ссылка",        Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Если РезультатЗапроса.Следующий() Тогда 			
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Для указнного вида подписанта и документа по умолчанию выбран " + Строка(РезультатЗапроса.Ссылка), Отказ);  			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
